{
  "en": {
    "nav_about": "About",
    "nav_vision": "Vision",
    "nav_research": "Research",
    "nav_demos": "Demos",
    "nav_pubs": "Publications",
    "nav_ach": "Achievements",
    "nav_contact": "Contact",
    "cv_download": "Download CV",
    
    "hero_tag": "Computational Neuroengineering",
    "hero_subtitle": "AI/ML for Cognitive State Monitoring in Safety-Critical Systems · LIECAR Lab, UNSAAC · Cusco, Peru",
    "metric_citations": "Citations",
    "metric_pubs": "Publications",
    "metric_reviews": "Peer Reviews",
    "btn_view_pubs": "View Publications",
    
    "about_label": "About",
    "about_title": "Building multimodal AI systems for real-time cognitive state monitoring in safety-critical environments",
    "about_p1": "I develop multimodal AI architectures that monitor human cognitive state in real time — with a focus on safety-critical environments where cognitive impairment directly translates to lives at risk.",
    "about_p2": "My work integrates EEG signal processing, computer vision, and deep learning to design interpretable, deployable architectures that go beyond lab prototypes: systems that run on embedded hardware, handle real-world noise, and produce outputs that can be trusted in high-stakes decisions.",
    "about_p3": "I am a researcher at the LIECAR Laboratory and lecturer at the Universidad Nacional de San Antonio Abad del Cusco (UNSAAC), Peru, recognized as a <strong>RENACYT Level V researcher</strong> by CONCYTEC. I serve as a peer reviewer for international scientific publications including <strong>Scientific Reports (Nature Portfolio)</strong> and <strong>ACM Transactions on Intelligent Systems and Technology</strong>.",
    
    "badge1": "EEG Signal Processing",
    "badge2": "Multimodal AI",
    "badge3": "Driver Drowsiness Detection",
    "badge4": "Embedded Deep Learning",
    "badge5": "Safety-Critical Systems",
    "badge6": "Cognitive Neuroscience",
    
    "vision_label": "Vision",
    "vision_title": "Research Vision",
    "vision_text": "My long-term goal is to develop interpretable multimodal systems that understand human cognitive vulnerability in real-world environments — bridging neuroengineering, deployable AI, and human-machine safety. I aim to establish a research line where physiological sensing, edge computing, and explainability converge to build systems that are not only accurate, but trustworthy enough to be deployed in vehicles, surgical suites, and control rooms.",
    
    "pillar1": "Neuro-ocular sensing",
    "pillar2": "Edge AI deployment",
    "pillar3": "Explainable models",
    "pillar4": "Safety-critical systems",
    
    "interests_label": "Focus Areas",
    "interests_title": "Research Interests",
    
    "int1_title": "Cognitive State Monitoring",
    "int1_desc": "Real-time detection of drowsiness, fatigue, and mental workload in operators of safety-critical systems such as vehicles, aviation, and industrial control.",
    "int2_title": "EEG Signal Processing",
    "int2_desc": "Biomarker extraction, artifact removal, and feature engineering from EEG signals for reliable cognitive state classification under real-world conditions.",
    "int3_title": "Multimodal AI Fusion",
    "int3_desc": "Combining EEG, eye-tracking (RGB–NIR cameras), and facial landmark dynamics for robust, redundant cognitive state inference beyond single-modality limits.",
    "int4_title": "Embedded Deep Learning",
    "int4_desc": "Deploying CNN and hybrid models on edge platforms (NVIDIA Jetson Nano) for low-latency, on-device inference in real-world applications.",
    "int5_title": "Interpretable AI for Human Factors",
    "int5_desc": "Moving beyond black-box models toward systems that are auditable, explainable, and reliable — a critical requirement for high-stakes AI deployment.",
    
    "research_label": "Active Project",
    "research_title": "Current Research",
    "research_status": "Active · Targeting Q1 2026",
    "research_h3": "Multimodal Neuro-Ocular System for Driver Drowsiness Detection",
    "research_p1": "The leading cause of fatal road accidents is not mechanical failure — it's cognitive impairment behind the wheel. This project develops a real-time monitoring system that detects driver drowsiness and mental fatigue by fusing EEG biomarkers, eye-tracking dynamics via RGB and NIR cameras, and facial landmark modeling.",
    "research_p2": "Signals are processed through a multimodal deep learning architecture and deployed on an NVIDIA Jetson Nano for real-time, on-vehicle inference. A key focus is interpretability — using attention mechanisms and saliency maps to make model decisions transparent and trustworthy for safety-critical deployment.",
    
    "demos_label": "Live Demos",
    "demos_title": "Research in Action",
    
    "demo1_gif1_title": "NITYMED Dataset Evaluation",
    "demo1_gif1_desc": "CNN model evaluation on public NITYMED dataset. Eye closure detection with 96.3% accuracy in controlled conditions.",
    "demo1_gif2_title": "Real-world Validation",
    "demo1_gif2_desc": "Validation under real lighting conditions. Robust detection at 30 FPS with varying illumination and head movements.",
    
    "demo2_gif1_title": "Visual Drowsiness Detection",
    "demo2_gif1_desc": "Real-time eye analysis on NVIDIA Jetson Nano. Micro-sleep detection with visual alerts at <15ms latency.",
    "demo2_gif2_title": "Yawn Detection (MAR)",
    "demo2_gif2_desc": "Mouth Aspect Ratio (MAR) analysis for real-time fatigue detection. Integrated with facial landmark tracking.",
    
    "pubs_label": "Publications",
    "pubs_title": "Selected Publications",
    "pubs_full_list": "Full list on",
    "filter_all": "All",
    "filter_cogni": "Cognitive Monitoring",
    "filter_cv": "Computer Vision",
    "cit": "citations",
    
    "teaching_label": "Teaching",
    "teaching_title": "Teaching Experience",
    "teaching_sub": "Universidad Nacional de San Antonio Abad del Cusco (UNSAAC) · School of Electronic Engineering · April 2024 – Present",
    "course1": "Artificial Intelligence",
    "course2": "Digital Image Processing",
    "course3": "Robotics",
    "course4": "Electronics Laboratory",
    "course_level": "Undergraduate · Electronic Engineering",
    
    "ach_label": "Achievements",
    "ach_title": "Selected Achievements",
    "ach1": "Total citations — one paper surpassing 82 citations within 2 years",
    "ach2": "Most cited paper on real-time CNN-based eye-state drowsiness detection — 82 citations",
    "ach3": "RENACYT Level V researcher — CONCYTEC national recognition",
    "ach4": "Active peer reviewer for international journals including ACM TIST and Scientific Reports",
    "ach5": "First place in regional/national competitions including First Andean Hackathon (6 countries)",
    "ach6": "Target submission 2026 — multimodal neuro-ocular system to high-impact journal",
    
    "review_label": "Peer Review",
    "review_title": "Peer Review Activity",
    "review_th1": "Journal",
    "review_th2": "Publisher",
    "review_th3": "Reviews",
    "review_orcid_note": "Verified via ORCID iD:",
    
    "contact_label": "Contact",
    "contact_title": "Get in Touch",
    "contact_text": "I am open to research collaborations, dataset sharing, joint publications, academic exchanges, and PhD opportunities in neuroengineering, human factors AI, or safety-critical systems.",
    "open_title": "Open to",
    "open1": "Research collaborations",
    "open2": "Dataset sharing",
    "open3": "Joint publications",
    "open4": "Academic exchanges",
    "open5": "PhD opportunities",
    "open6": "Industry partnerships",
    
    "footer": "© 2025 Ruben Dario Florez-Zela · UNSAAC · Cusco, Peru"
  },
  
  "es": {
    "nav_about": "Sobre mí",
    "nav_vision": "Visión",
    "nav_research": "Investigación",
    "nav_demos": "Demos",
    "nav_pubs": "Publicaciones",
    "nav_ach": "Logros",
    "nav_contact": "Contacto",
    "cv_download": "Descargar CV",
    
    "hero_tag": "Neuroingeniería Computacional",
    "hero_subtitle": "IA/ML para Monitoreo del Estado Cognitivo en Sistemas de Alta Seguridad · Lab. LIECAR, UNSAAC · Cusco, Perú",
    "metric_citations": "Citas",
    "metric_pubs": "Publicaciones",
    "metric_reviews": "Revisiones",
    "btn_view_pubs": "Ver Publicaciones",
    
    "about_label": "Sobre mí",
    "about_title": "Construyendo sistemas de IA multimodal para monitoreo cognitivo en tiempo real en entornos de alta seguridad",
    "about_p1": "Desarrollo arquitecturas de IA multimodal que monitorean el estado cognitivo humano en tiempo real, con enfoque en entornos de alta seguridad donde el deterioro cognitivo se traduce directamente en vidas en riesgo.",
    "about_p2": "Mi trabajo integra procesamiento de señales EEG, visión computacional y aprendizaje profundo para diseñar arquitecturas interpretables y desplegables que van más allá de los prototipos de laboratorio: sistemas que operan en hardware embebido, manejan ruido del mundo real y generan salidas confiables para decisiones críticas.",
    "about_p3": "Soy investigador en el Laboratorio LIECAR y docente de la Universidad Nacional de San Antonio Abad del Cusco (UNSAAC), Perú, reconocido como <strong>Investigador RENACYT Nivel V</strong> por CONCYTEC. Ejerzo como revisor de publicaciones científicas internacionales incluyendo <strong>Scientific Reports (Nature Portfolio)</strong> y <strong>ACM Transactions on Intelligent Systems and Technology</strong>.",
    
    "badge1": "Procesamiento de Señales EEG",
    "badge2": "IA Multimodal",
    "badge3": "Detección de Somnolencia",
    "badge4": "Deep Learning Embebido",
    "badge5": "Sistemas de Alta Seguridad",
    "badge6": "Neurociencia Cognitiva",
    
    "vision_label": "Visión",
    "vision_title": "Visión de Investigación",
    "vision_text": "Mi objetivo a largo plazo es desarrollar sistemas multimodales interpretables que comprendan la vulnerabilidad cognitiva humana en entornos reales — conectando la neuroingeniería, la IA desplegable y la seguridad humano-máquina. Busco establecer una línea de investigación donde la detección fisiológica, la computación en el borde y la explicabilidad converjan para construir sistemas que no solo sean precisos, sino lo suficientemente confiables para desplegarse en vehículos, quirófanos y salas de control.",
    
    "pillar1": "Detección neuro-ocular",
    "pillar2": "IA en el borde (Edge)",
    "pillar3": "Modelos explicables",
    "pillar4": "Sistemas de alta seguridad",
    
    "interests_label": "Áreas de Enfoque",
    "interests_title": "Intereses de Investigación",
    
    "int1_title": "Monitoreo del Estado Cognitivo",
    "int1_desc": "Detección en tiempo real de somnolencia, fatiga y carga mental en operadores de sistemas críticos como vehículos, aviación y control industrial.",
    "int2_title": "Procesamiento de Señales EEG",
    "int2_desc": "Extracción de biomarcadores, eliminación de artefactos e ingeniería de características a partir de señales EEG para clasificación confiable del estado cognitivo en condiciones reales.",
    "int3_title": "Fusión Multimodal de IA",
    "int3_desc": "Combinación de EEG, seguimiento ocular (cámaras RGB–NIR) y dinámicas de puntos de referencia faciales para inferencia robusta y redundante del estado cognitivo.",
    "int4_title": "Deep Learning Embebido",
    "int4_desc": "Despliegue de modelos CNN e híbridos en plataformas de borde (NVIDIA Jetson Nano) para inferencia en dispositivo con baja latencia en aplicaciones reales.",
    "int5_title": "IA Interpretable para Factores Humanos",
    "int5_desc": "Avanzar más allá de los modelos de caja negra hacia sistemas auditables, explicables y confiables — requisito crítico para el despliegue de IA en entornos de alto riesgo.",
    
    "research_label": "Proyecto Activo",
    "research_title": "Investigación Actual",
    "research_status": "Activo · Envío objetivo Q1 2026",
    "research_h3": "Sistema Neuro-Ocular Multimodal para Detección de Somnolencia en Conductores",
    "research_p1": "La principal causa de accidentes fatales de tránsito no es el fallo mecánico — es el deterioro cognitivo al volante. Este proyecto desarrolla un sistema de monitoreo en tiempo real que detecta somnolencia y fatiga mental fusionando biomarcadores EEG, dinámicas de seguimiento ocular mediante cámaras RGB y NIR, y modelado de puntos de referencia faciales.",
    "research_p2": "Las señales se procesan mediante una arquitectura de aprendizaje profundo multimodal y se despliegan en un NVIDIA Jetson Nano para inferencia en tiempo real a bordo del vehículo. Un enfoque clave es la interpretabilidad — usando mecanismos de atención y mapas de prominencia para hacer transparentes y confiables las decisiones del modelo en despliegues críticos.",
    
    "demos_label": "Demostraciones",
    "demos_title": "Investigación en Acción",
    
    "demo1_gif1_title": "Evaluación en Dataset NITYMED",
    "demo1_gif1_desc": "Evaluación del modelo CNN en dataset público NITYMED. Detección de ojos cerrados con 96.3% de precisión en condiciones controladas.",
    "demo1_gif2_title": "Validación en Entorno Real",
    "demo1_gif2_desc": "Validación en condiciones reales de iluminación. Detección robusta a 30 FPS con variaciones de luz y movimiento.",
    
    "demo2_gif1_title": "Detección Visual de Somnolencia",
    "demo2_gif1_desc": "Análisis de ojos en tiempo real en NVIDIA Jetson Nano. Detección de micro-sueños con alertas visuales a <15ms de latencia.",
    "demo2_gif2_title": "Detección de Bostezos (MAR)",
    "demo2_gif2_desc": "Análisis de Mouth Aspect Ratio (MAR) para detección de fatiga en tiempo real. Integrado con seguimiento de puntos faciales.",
    
    "pubs_label": "Publicaciones",
    "pubs_title": "Publicaciones Seleccionadas",
    "pubs_full_list": "Lista completa en",
    "filter_all": "Todas",
    "filter_cogni": "Monitoreo Cognitivo",
    "filter_cv": "Visión Computacional",
    "cit": "citas",
    
    "teaching_label": "Docencia",
    "teaching_title": "Experiencia Docente",
    "teaching_sub": "Universidad Nacional de San Antonio Abad del Cusco (UNSAAC) · Escuela de Ingeniería Electrónica · Abril 2024 – Presente",
    "course1": "Inteligencia Artificial",
    "course2": "Procesamiento Digital de Imágenes",
    "course3": "Robótica",
    "course4": "Laboratorio de Electrónica",
    "course_level": "Pregrado · Ingeniería Electrónica",
    
    "ach_label": "Logros",
    "ach_title": "Logros Destacados",
    "ach1": "Citas totales — un artículo superó 82 citas en 2 años",
    "ach2": "Artículo más citado en detección de somnolencia CNN en tiempo real — 82 citas",
    "ach3": "Investigador RENACYT Nivel V — reconocimiento nacional CONCYTEC",
    "ach4": "Revisor activo para revistas internacionales incluyendo ACM TIST y Scientific Reports",
    "ach5": "Primer lugar en competencias regionales/nacionales incluyendo Primera Hackathon Andina (6 países)",
    "ach6": "Envío objetivo 2026 — sistema neuro-ocular multimodal a revista de alto impacto",
    
    "review_label": "Revisión por Pares",
    "review_title": "Actividad como Revisor",
    "review_th1": "Revista",
    "review_th2": "Editorial",
    "review_th3": "Revisiones",
    "review_orcid_note": "Verificado vía ORCID iD:",
    
    "contact_label": "Contacto",
    "contact_title": "Ponerse en Contacto",
    "contact_text": "Estoy abierto a colaboraciones de investigación, intercambio de datos, publicaciones conjuntas, intercambios académicos y oportunidades de doctorado en neuroingeniería, IA para factores humanos o sistemas de alta seguridad.",
    "open_title": "Disponible para",
    "open1": "Colaboraciones de investigación",
    "open2": "Intercambio de datasets",
    "open3": "Publicaciones conjuntas",
    "open4": "Intercambios académicos",
    "open5": "Oportunidades de doctorado",
    "open6": "Alianzas con la industria",
    
    "footer": "© 2025 Ruben Dario Florez-Zela · UNSAAC · Cusco, Perú"
  }
}
